<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionTableSeeder extends Seeder
{
    public function run(): void
    {
        $permissions = [

            // فواتير
            'الفواتير',
            'قائمة الفواتير',
            'الفواتير المدفوعة',
            'الفواتير المدفوعة جزئيا',
            'الفواتير الغير مدفوعة',
            'ارشيف الفواتير',

            // تقارير
            'التقارير',
            'تقرير الفواتير',
            'تقرير العملاء',

            // مستخدمين وصلاحيات
            'المستخدمين',
            'قائمة المستخدمين',
            'صلاحيات المستخدمين',

            // إعدادات
            'الاعدادات',

            // منتجات وأقسام
            'المنتجات',
            'الاقسام',

            // عمليات على الفاتورة
            'عرض فاتورة',
            'اضافة فاتورة',
            'تعديل فاتورة',
            'حذف فاتورة',
            'تصدير EXCEL',
            'تغير حالة الدفع',
            'ارشفة الفاتورة',
            'طباعةالفاتورة',
            'اضافة مرفق',
            'حذف المرفق',

            // عمليات على المستخدمين
            'عرض مستخدم',
            'اضافة مستخدم',
            'تعديل مستخدم',
            'حذف مستخدم',

            // صلاحيات
            'عرض صلاحية',
            'اضافة صلاحية',
            'تعديل صلاحية',
            'حذف صلاحية',

            // منتجات
            'اضافة منتج',
            'تعديل منتج',
            'حذف منتج',

            // أقسام
            'اضافة قسم',
            'تعديل قسم',
            'حذف قسم',

            // إشعارات
            'الاشعارات',
        ];

        foreach ($permissions as $permission) {
            Permission::firstOrCreate(['name' => $permission]);
        }
    }
}
